W6D3/first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" IS NULL
---
  def index
    artworks = Artwork.where(artist_id: params[:user_id])

    shared_artwork = User.find(params[:user_id]).shared_artworks